package main

import "fmt"

// Одне яблуко коштує 5.99 грн. Ціна однієї груші - 7 грн.
// Ми маємо 23 грн.
// 1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?
// 2. Скільки груш ми можемо купити?
// 3. Скільки яблук ми можемо купити?
// 4. Чи ми можемо купити 2 груші та 2 яблук

func main() {
	a := 5.99
	d := 7.0
	t := 23.0

	fmt.Println("Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?")
	fmt.Println("Щоб купити 9 яблук та 8 груш потрібно: ", a*9+d*8, "грн")

	fmt.Println("\nСкільки груш ми можемо купити?")
	fmt.Println("За ", t, "грн ми можемо купити груш:", int(t/d), "шт.")

	fmt.Println("\nСкільки яблук ми можемо купити?")
	fmt.Println("За ", t, "грн ми можемо купити яблук:", int(t/a), "шт.")

	fmt.Println("\nЧи ми можемо купити 2 груші та 2 яблук?")
	if t >= (a*2 + d*2) {
		fmt.Println("Так")
	} else {
		fmt.Println("Ні")
	}
}
